{
  "id": "sS0dHmaH1I",
  "original": "bBMbKx74ILs",
  "number": 193,
  "cdate": 1632875435531,
  "pdate": 1643407560000,
  "odate": 1633539600000,
  "mdate": null,
  "tcdate": 1632875435531,
  "tmdate": 1676330684010,
  "ddate": null,
  "content": {
    "title": "Fast Adaptive Anomaly Detection",
    "authorids": [
      "~Ze_Wang3",
      "~Yipin_Zhou4",
      "~Rui_Wang23",
      "~Tsung-Yu_Lin2",
      "~Ashish_Shah1",
      "~Ser-Nam_Lim3"
    ],
    "authors": [
      "Ze Wang",
      "Yipin Zhou",
      "Rui Wang",
      "Tsung-Yu Lin",
      "Ashish Shah",
      "Ser-Nam Lim"
    ],
    "keywords": [],
    "abstract": "The ability to detect anomaly has long been recognized as an inherent human ability, yet to date, practical AI solutions to mimic such capability have been lacking.This lack of progress can be attributed to several factors.  To begin with, the distribution of “abnormalities” is intractable.   Anything outside of a given normal population is by definition an anomaly. This explains why a large volume of workin this area has been dedicated to modeling the normal distribution of a given task followed by detecting deviations from it. This direction is however unsatisfying as it would require modeling the normal distribution of every task that comes along, which includes tedious data collection.  In this paper, we report our work aiming to handle these issues. To deal with the intractability of abnormal distribution, we leverage Energy Based Model (EBM). EBMs learn to associates low energies to correct values and higher energies to incorrect values.  As its core, the EBM em-ploys Langevin Dynamics (LD) in generating these incorrect samples based on an iterative optimization procedure, alleviating the intractable problem of modeling the world of anomalies.  Then, in order to avoid training an anomaly detector for every task, we utilize an adaptive sparse coding layer. Our intention is to design a plug and play feature that can be used to quickly update what is normal during inference time. Lastly, to avoid tedious data collection, this mentioned update of the sparse coding layer needs to be achievable with just a few shots. Here, we employ a meta learning scheme that simulates such a few shot setting during training. We support our findings with strong empirical evidence.",
    "code_of_ethics": "",
    "submission_guidelines": "",
    "resubmission": "",
    "student_author": "",
    "serve_as_reviewer": "",
    "paperhash": "wang|fast_adaptive_anomaly_detection",
    "pdf": "/pdf/869517e2f57dba032ca65614321c370f70135e36.pdf",
    "_bibtex": "@misc{\nwang2022fast,\ntitle={Fast Adaptive Anomaly Detection},\nauthor={Ze Wang and Yipin Zhou and Rui Wang and Tsung-Yu Lin and Ashish Shah and Ser-Nam Lim},\nyear={2022},\nurl={https://openreview.net/forum?id=sS0dHmaH1I}\n}",
    "venue": "ICLR 2022 Submitted",
    "venueid": "ICLR.cc/2022/Conference"
  },
  "forum": "sS0dHmaH1I",
  "referent": null,
  "invitation": "ICLR.cc/2022/Conference/-/Blind_Submission",
  "replyto": null,
  "readers": [
    "everyone"
  ],
  "nonreaders": [],
  "signatures": [
    "ICLR.cc/2022/Conference"
  ],
  "writers": [
    "ICLR.cc/2022/Conference"
  ],
  "details": {
    "overwriting": [],
    "tags": [],
    "writable": false,
    "replyCount": 13,
    "directReplyCount": 8,
    "revisions": true,
    "replies": [
      {
        "id": "_gCmFqMziZD",
        "original": null,
        "number": 1,
        "cdate": 1635826995959,
        "mdate": null,
        "ddate": null,
        "tcdate": 1635826995959,
        "tmdate": 1635826995959,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Review",
        "content": {
          "summary_of_the_paper": "The paper presents an anomaly detection algorithm that uses an EBM (Energy Based Model) to distinguish between 'normal' and 'anomaly'. This model generates pseudo-anomaly instances on-the-fly for each 'normal' instance and then learns to assign low energy to normal instances and high energy to pseudo-anomaly instances. The model is further designed to be able to adapt quickly (few 'normal' labeled examples) to new tasks.",
          "main_review": "Pros:\n1. Presents a well-reasoned set of design choices\n2. Good ablation studies\n\nCons:\n1. Assumes all training data is 'normal'\n2. Lacks experiments with contaminated training data\n\n\nMain Comments\n\n1. Expects all training data to be 'normal' -- effectively makes the algorithm fully supervised since we must manually make sure that all input train data is 'normal'.\n\n2. Should show performance of algorithm when training data is contaminated with anomalies (varying contamination fraction, say, from 0.0 ... 0.10).\n\n3. Section 3.1: \"The sparsity regularization to ... formulated as the mean squared error (MSE) between the original\" -- This is a nice explanation of the design choice.\n",
          "summary_of_the_review": "The paper mixes existing techniques in a nice way to make the overall solution very effective.",
          "correctness": "4: All of the claims and statements are well-supported and correct.",
          "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "flag_for_ethics_review": [
            "NO."
          ],
          "recommendation": "8: accept, good paper",
          "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Reviewer_4fuZ"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Reviewer_4fuZ"
        ]
      },
      {
        "id": "bTGe3YpARgd",
        "original": null,
        "number": 2,
        "cdate": 1636070178453,
        "mdate": null,
        "ddate": null,
        "tcdate": 1636070178453,
        "tmdate": 1636070178453,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Review",
        "content": {
          "summary_of_the_paper": "The author proposes a fast adaptive anomaly detection method using an adaptive sparse coding layer in the few-shot setting. The proposed method outperforms baselines.",
          "main_review": "Strength:\n\n+ The experimental result on two benchmark datasets outperforms most of the baselines.\n+ An ablation study is presented to demonstrate the robustness of the proposed method.\n\nHowever, there are also some places where this paper needs further clarifications:\n- It is not clearly shown in the experiment as to how the technique in Section 3.1 improves the robustness of the network on different types of objects.\n- A small typo in Section 3.1 - visualizations of the hard shrinkage function and SigShrink with different values of $\\tau$ are presented in Fig. 3 rather than Fig. 7.\n- The caption of Table I suggests that “Col 2-5 are fully supervised methods trained with massive normal samples” and are considered as the “upper-bounds”. However, it seems like the first column with AE (SSIM) is able to deliver better results in many categories than these upper bounds? (such as Carpet, Grid, and Bottle).\n- It seems from Table 2 that the proposed method without leveraging any temporal information can achieve even better performance in the CUHK Avenue and the SH-Tech dataset. More discussions are encouraged on the benefit of incorporating such temporal information versus image frames randomly sampled from the target scenes.\n",
          "summary_of_the_review": "To summarize, this paper proposed a fast adaptive anomaly detection framework for anomaly detection in images. The proposed method is technically sound. However, the novelty is limited on the adaptive space coding layer with receptive field, while the rest of the network structure seems to be a big melting pot incorporating the Energy Bassed Model and episodic training in the context of meta-learning based few-shot learning. ",
          "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
          "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "flag_for_ethics_review": [
            "NO."
          ],
          "recommendation": "6: marginally above the acceptance threshold",
          "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Reviewer_egaq"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Reviewer_egaq"
        ]
      },
      {
        "id": "IfVjLa5G-W",
        "original": null,
        "number": 3,
        "cdate": 1636260478756,
        "mdate": null,
        "ddate": null,
        "tcdate": 1636260478756,
        "tmdate": 1636295559743,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Review",
        "content": {
          "summary_of_the_paper": "This paper proposes an image classification system, where a set of normal patterns are stored as a \"dictionary,\" and the degree of deviation is used as the anomaly score. \n \nThe overall architecture seems to feature a conventional deep encoder and a pattern matching module that compares the encoded latent vector against the pattern dictionary. The pattern matching is done by solving the lasso regression problem. \n\nThe authors propose a certain online learning approach, following existing few-shot learning methods, and also a synthetic sample generation approach using random perturbation combined with a gradient method. ",
          "main_review": "This paper can be viewed as a proposal of a new image anomaly detection system that combines existing methods. The proposed \"adaptive\" dictionary-based approach is not new. The use of a deep encoder for image analysis is, of course, not new. The term \"energy-based\" does not mean much because any probability distribution can be thought of as energy-based. So the question is whether the combination is innovative or not. \n\nAlthough I appreciate the authors' efforts to develop an industry-application-ready image processing system, I do not think the technical novelty meets the standard that ICLR papers are supposed to have. \n\n\nEq.(2)\nThe sign of ln Z?\n\nEq.(3) \ny is not defined in the generative model in Eq. (1). \n\np.3\n The problem setting should be clearly defined. What are the input and output? The anomaly score must be clearly defined in the main text as part of the problem setting. ",
          "summary_of_the_review": "- Good industrial use-case paper\n- Limited technical novelty -- less innovative combination of known methods. ",
          "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
          "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
          "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
          "flag_for_ethics_review": [
            "NO."
          ],
          "recommendation": "3: reject, not good enough",
          "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Reviewer_Mzn6"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Reviewer_Mzn6"
        ]
      },
      {
        "id": "vTre9Owal6f",
        "original": null,
        "number": 4,
        "cdate": 1636331808547,
        "mdate": null,
        "ddate": null,
        "tcdate": 1636331808547,
        "tmdate": 1636331808547,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Review",
        "content": {
          "summary_of_the_paper": "The paper proposes a framework for anomaly detection and localization that allows fast adaptation to new tasks. \nSpecifically, the authors propose an energy-based model (EBM) with an adaptive sparse coding layer directly trained with normal features of a target task.\n\nA meta-learning process is followed to extract common knowledge across tasks enabling few shots adaptation. \nShrinkage functions, sparse coding with large receptive fields, and learning by inpainting are introduced to improve and accelerate the EBM\ntraining. ",
          "main_review": "Strengths:\n\n- The method adapts to new tasks autonomously;\n- Ablation study and comparison with supervised models;\n- Exhaustive implementation details in the Appendix section.\n\nWeaknesses: \n\n- Experimental analysis is limited to image and video datasets;\n- The mIoU metric is never defined in the paper;\n- Fairly limited scope of competitor methods (which could depend on the limited suitability of other methods in the adopted setting).",
          "summary_of_the_review": "The paper proposes an interesting anomaly detection approach and an experimental evaluation that also involves fully supervised models.\n\nResults are competitive, and some of them appear close to the upper bound performances provided by supervised alternatives.\n\nThe authors also provide an exhaustive description of the architecture and hyperparameters in the Appendix section.\n\nI think the main merit of the proposed method is the ability to achieve satisfactory anomaly detection performance without large availability of normal samples while adapting to new tasks.",
          "correctness": "4: All of the claims and statements are well-supported and correct.",
          "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "flag_for_ethics_review": [
            "NO."
          ],
          "recommendation": "8: accept, good paper",
          "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Reviewer_rnYM"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Reviewer_rnYM"
        ]
      },
      {
        "id": "7JKIsZpFTL-",
        "original": null,
        "number": 5,
        "cdate": 1636354184647,
        "mdate": null,
        "ddate": null,
        "tcdate": 1636354184647,
        "tmdate": 1636354184647,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Review",
        "content": {
          "summary_of_the_paper": "This paper presents a model for detecting irregularities in images, such as would occur in manufacturing acceptance testing.  As a form of anomaly detection, the claims made are for a principled modeling approach and an adaptive algorithm quick to learn from just a few samples.   Based on \"energy based models\" for modeling data densities, the paper claims improvements to avoid the need for retraining for new tasks, such as, instead of synthesizing negative samples rom noise, using a more targeted method of “learning from\ninpainting” operation to learn anomalies. \n\n",
          "main_review": "The paper claims a \"principled\" approach to detecting rare samples compared to normal ones.  One would expect that abnormality implies improbability.  The \"principle\" here is that something abnormal is something whose probability is small.  The paper never avails itself of any discussion of  what it means to be \"anomalous\" in terms of probability.  Similarly neither does the evaluation section mention anything about false positive or false negative detection rates. \n\nAs an example of this confusion, the use of the term \"normal\" in the introduction could refer to a normal, that is Gaussian distribution of the non-anomalous population. Fitting a normal distribution to samples, then looking for samples that fall on the tails of the distribution is a conventional method to detect anomalies.  Since this is not what the paper proposes, the authors may want to clarify this at the outset.  However it raises the speculation whether the mean squared error expressed in Equation 8 is just implicitly an appeal to a normal distribution. A quadratic error term is consistent with the use of a Gaussian (normal) distribution. \n\nHonestly I find it hard to tell if the evaluation presented in the paper makes the case for improvement over other deep learning methods, or more conventional image analysis methods.  It appears the main take-away from the evaluation section is the acceptable detection ability on limited number of samples.   How does this method stack up with previous methods when given comparably large numbers of training samples?  ",
          "summary_of_the_review": "In short, the term 'anomaly detection' has been applied to a wide range of unsupervised techniques, with little in common among them.  This literature, using deep learning methods that have no connection to the existing literature that is more than a decade old, calls into question whether the proposed methods are competitive with previous methods that do not originate by applying deep learning techniques.  One really has to look at the history of the field to claim to have made an advance. \n\nMy apologies for a shallow review due to a lack of familiarity with this branch of the field, however there are some basic questions that need to be raised about the lack of connection of the field with the vast work that precedes the current trend in deep learning to really understand the significance of the work. ",
          "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
          "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
          "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
          "flag_for_ethics_review": [
            "NO."
          ],
          "recommendation": "5: marginally below the acceptance threshold",
          "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Reviewer_d5Wi"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Reviewer_d5Wi"
        ]
      },
      {
        "id": "SZQ57lRpvsB",
        "original": null,
        "number": 5,
        "cdate": 1637206814010,
        "mdate": null,
        "ddate": null,
        "tcdate": 1637206814010,
        "tmdate": 1637206999742,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "7JKIsZpFTL-",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Comment",
        "content": {
          "title": "Response to reviewer d5Wi",
          "comment": "We appreciate the feedback which raises an important question on what is normal and abnormal. We present our response as bullet points below and hope these could address the reviewer’s concerns about our paper.\n\n___\n\n**Comment:**\n\n“The paper claims a \"principled\" approach to detecting rare samples compared to normal ones. One would expect that abnormality implies improbability. The \"principle\" here is that something abnormal is something whose probability is small. The paper never avails itself of any discussion of what it means to be \"anomalous\" in terms of probability. Similarly, neither does the evaluation section mention anything about false positive or false negative detection rates.\n\nAs an example of this confusion, the use of the term \"normal\" in the introduction could refer to a normal, that is Gaussian distribution of the non-anomalous population. Fitting a normal distribution to samples, then looking for samples that fall on the tails of the distribution is a conventional method to detect anomalies. Since this is not what the paper proposes, the authors may want to clarify this at the outset. However, it raises the speculation whether the mean squared error expressed in Equation 8 is just implicitly an appeal to a normal distribution. A quadratic error term is consistent with the use of a Gaussian (normal) distribution.”\n\n**Response:**\n\n**“Normal” and “Abnormal\" in terms of probability.** Our perspective in this paper is that the definitions of normal and abnormal are not easily represented by any specific quantity or probability. Normal samples are subjective to the use cases and vary from task to task. For example, in industrial inspection, normal samples are defined as the set of defect-free industrial components and anything which can not fit into this set would be considered as abnormal (objects with defects), while in autonomous driving, one can imagine that anomalies are foreground objects. It is therefore quite important that any approach to anomaly detection needs to be based on a “support set of normal samples” from which anomalies can be well defined, which is the essence of what is proposed in our paper and was clearly stated. Along this line, our paper looks at two critical components: (1) how do we represent the “support set” efficiently for which we proposed an energy based model and meta learning, and (2) how do we onboard a new support set rapidly for which we proposed a sparse coding approach. Regarding the evaluation metric, false positive and false negative detection rates can vary significantly w.r.t. the threshold picking. We follow the common practice of anomaly detection and report AUC-ROC which is threshold-invariant, therefore offering a comprehensive measurement of the model performance.\n\n**The term “normal”**. The term ‘normal’ used in our paper is not directly related to the Normal (Gaussian) distribution. The samples from real-world datasets are high-dimensional, and existing distributions are unable to adequately describe them. This is one of the reasons why data-driven attributes of deep learning-based methods are much more appropriate here as we have shown in the paper.\n\n___\n\n**Comment:**\n\n“Honestly I find it hard to tell if the evaluation presented in the paper makes the case for improvement over other deep learning methods, or more conventional image analysis methods. It appears the main take-away from the evaluation section is the acceptable detection ability on limited number of samples. How does this method stack up with previous methods when given comparably large numbers of training samples?”\n\n**Response:**\n\nWe emphasize that this paper is addressing few shot adaptive anomaly detection, not when a large number of training samples are available which is outside the scope of our paper. There has been no previous work in anomaly detection in a few shot settings in industrial inspection as far as we know. Therefore to compare and get a sense of the progress this paper made, we provided performance on supervised methods (Table 1 for industrial inspection) as well as a strong baseline, MAML-AE. Comparison with the former is not apple to apple, but it helps to shed light on our approach. For the video surveillance task, there is an early work on fast adaptation, r-GAN, which we also proved in Table 2 is outperformed by our method. \n\nAlthough we are addressing fast adaptive anomaly detection, nevertheless, in Appendix Section B.3, we have shown that applying the conventional method based on image difference did not achieve satisfying results. We also provide the performance of [a] (non-deep learning method) under the fast adaptation scenario on the CUHK dataset, which achieves an **AUC-ROC of 59.45**. The performance is significantly degraded compared with **75.32** achieved by our method.\n\n___\n\n[a] Online detection of unusual events in videos via dynamic sparse coding, CVPR 2011\n"
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "readers": [
          "everyone",
          "ICLR.cc/2022/Conference/Program_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Senior_Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Reviewers",
          "ICLR.cc/2022/Conference/Paper193/Reviewers/Submitted",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ]
      },
      {
        "id": "m2Xh_IqVlk",
        "original": null,
        "number": 6,
        "cdate": 1637207179987,
        "mdate": 1637207179987,
        "ddate": null,
        "tcdate": 1637207179987,
        "tmdate": 1637207179987,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "vTre9Owal6f",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Comment",
        "content": {
          "title": "Response to reviewer rnYM",
          "comment": "We thank the reviewer for the constructive feedback as well as the recognition of the novelty and contribution of our work. We address the reviewer's concerns below.\n\n**1. Experimental analysis is limited to image and video datasets**\n\nWe appreciate the comments. In this work, we mainly focus on anomaly detection from the Computer Vision perspective, which is challenging due to the high-dimensional input space and diverse patterns of anomaly. Extension to other modalities is definitely one of the doors we are hoping to open with this research.\n\n**2. Definition of mIoU**\n\nWe have included the definition of mIoU metric in the revised paper (at the end of the first paragraph of Sec 5.1).\n\n**3. The limited scope of competitor methods**\n\nAs the reviewer already mentioned, to the best of our knowledge, we are not able to find existing methods that are designed for anomaly detection under the fast adaptation scenario.\n\nWe have tried extending several existing few-shot density estimation methods including [a,b,c] to the same adaptive scenario like ours. Unfortunately, they failed to produce satisfying results on the real-world datasets we used. Combining MAML with the Autoencoder (MAML-AE) is the only extension that we found could deliver decent performance.\n\nWe agree with and thank the reviewer for correctly pointing out that the contribution of this paper lies in the capability of fast adapting to new tasks with only a few samples.\n\n___\n\n[a] Towards a Neural Statistician, ICLR 2017.\n\n[b] Conditional neural processes, ICML 2018.\n\n[c] SSD: A Unified Framework for Self-Supervised Outlier Detection, ICLR 2021."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "readers": [
          "everyone",
          "ICLR.cc/2022/Conference/Program_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Senior_Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Reviewers",
          "ICLR.cc/2022/Conference/Paper193/Reviewers/Submitted",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ]
      },
      {
        "id": "7Hd1ktE3Z8p",
        "original": null,
        "number": 7,
        "cdate": 1637207337258,
        "mdate": null,
        "ddate": null,
        "tcdate": 1637207337258,
        "tmdate": 1637335241445,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "IfVjLa5G-W",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Comment",
        "content": {
          "title": "Response to reviewer Mzn6",
          "comment": "We thank the feedback from the reviewer and we respectfully disagree with the reviewer regarding the novelty of our paper.\n\n**Regarding the task novelty**, to the best of our knowledge, we are the first to address both anomaly detection and localization under the fast adaptation scenario. This new problem setting could be significant for practical applications and we demonstrate that in the paper with two challenging real-world datasets. For this novel task, we specifically show in Table 1 and Table 2 that, although our method is only adapted to each novel category of objects or scene with **a few samples**, it is able to deliver performance that is at least comparable to that of those methods trained with **massive samples**.\n\n**Regarding technical novelty:**\n\n- The term energy-based model (EBM) in our paper refers to a track of research that falls under probabilistic models that are attracting increasing attention in recent years [a,b,c]. These models utilize Langevin dynamics and Contrastive divergence as the standard ways to conduct optimization. Our method is the first to explore and extend such an EBM with fast adaptation capability, which allows the modeled density to rapidly adapt to new tasks / concepts.\n\n- To the best of our knowledge, we are the first to present an adaptive dictionary that leverages meta-learning, and is able to achieve rapid dictionary updates through simple plugging in of features as the dictionary atoms. The smooth shrinkage function and the sparse coding with receptive fields are also new techniques that we propose to improve the sparse coding in deep models. (If the reviewer can suggest any related or similar works, we would be happy to discuss further.)\n\n**Regarding the correctness of the paper**, we would appreciate it if the reviewer could provide more details about the claims that the reviewer considered are not well-supported so that we could have further discussions.\n"
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "readers": [
          "everyone",
          "ICLR.cc/2022/Conference/Program_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Senior_Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Reviewers",
          "ICLR.cc/2022/Conference/Paper193/Reviewers/Submitted",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ]
      },
      {
        "id": "voX3fEbgx_5",
        "original": null,
        "number": 8,
        "cdate": 1637207466776,
        "mdate": null,
        "ddate": null,
        "tcdate": 1637207466776,
        "tmdate": 1637207643560,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "bTGe3YpARgd",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Comment",
        "content": {
          "title": "Response to reviewer egaq",
          "comment": "We appreciate the constructive feedback from the reviewer. We have made significant efforts to address the reviewer concerns below. We hope the reviewer will take these into account when making a final decision regarding our paper.\n\n**1. How the technique in Section 3.1 improves the robustness of the network on different types of objects**\n\nWe believe the concern is mainly referring to Section 3.1.1, where we enlarge the receptive field of the adaptive sparse coding layer to improve the robustness. As discussed in this section, for the feature extractor, a small receptive field hardly captures enough contextual information, while a large receptive field would make feature maps spatially coarse (hard to spot small anomaly regions). Thus applying a feature extractor without carefully tuning the receptive field of each layer might result in inconsistent performance. Instead, we enlarge the receptive field on the sparse coding layer (effectively capturing more contextual information while maintaining the ability to spot small anomaly regions) to make the model more robust when different objects are involved. \n \n**2. Typos**\n\nWe have fixed the typos in the revised version.\n\n**3. The caption of Table 1**\n\nThanks for pointing this out. In fact, we consider the ‘Category’ column as the first column in Table 1, therefore Col 2-5 refer to performance with AE (SSIM), AE (MSE), AnoGAN, and VE-VAE, which covers the column of AE (SSIM). We hope this resolves the reviewer's concern.\n\n**4. Leveraging temporal information**\n\nWe thank the reviewer for this constructive suggestion. The energy-based structure is agnostic to the network architectures and we could utilize other backbones (e.g. 3D CNN) to incorporate temporal information. We see no obstacle in applying spatial-temporal anomaly detection and will keep this as one of the potential future directions. We present preliminary results of leveraging temporal information in the revised **Appendix Section B.4**, where we utilize 3D convolutions with 5 frames as the input and achieve improved performance on 3 out of 4 video datasets. \n\n**5. Novelty of this paper**\n\nThe key innovation we are presenting in the paper is anomaly detection under the fast adaptation scenario. Regarding technical novelty, we are the first to extend the energy-base model with fast adaptation ability, which allows the learned density to quickly adapt to a new task without re-training the EBM.\n"
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "readers": [
          "everyone",
          "ICLR.cc/2022/Conference/Program_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Senior_Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Reviewers",
          "ICLR.cc/2022/Conference/Paper193/Reviewers/Submitted",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ]
      },
      {
        "id": "iMwnXBIso3z",
        "original": null,
        "number": 9,
        "cdate": 1637207525662,
        "mdate": 1637207525662,
        "ddate": null,
        "tcdate": 1637207525662,
        "tmdate": 1637207525662,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "_gCmFqMziZD",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Comment",
        "content": {
          "title": "Response to reviewer 4fuZ",
          "comment": "We thank the reviewer for the positive and constructive feedback, especially the suggestion about including contaminated training data.\n\nIn this paper, we follow the common practice in the field of anomaly detection in order to ensure fair comparisons are made, but we do agree with the reviewer that contaminated normal samples could be an issue for real-world use cases. To address this concern, we provide additional experiments with training data contaminated with 0 to 10% abnormal samples. For more details, please refer to **Appendix Section B.3**. Our method demonstrates robustness against a reasonable amount of data contamination. "
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "readers": [
          "everyone",
          "ICLR.cc/2022/Conference/Program_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Senior_Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Reviewers",
          "ICLR.cc/2022/Conference/Paper193/Reviewers/Submitted",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ]
      },
      {
        "id": "TPHDSwq9Az-",
        "original": null,
        "number": 11,
        "cdate": 1637890948237,
        "mdate": null,
        "ddate": null,
        "tcdate": 1637890948237,
        "tmdate": 1637890976034,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Comment",
        "content": {
          "title": "Message to reviewers",
          "comment": "Dear reviewers,\n\nOnce again, we would like to express our gratitude to all reviewers for their supportive and constructive feedback. \n\nWe have addressed the following comments and updated our manuscript accordingly:\n- As suggested by Reviewer **4fuZ**, we have performed experiments with contaminated data, and presented the results in Appendix Section B.3 in the revision.\n- As suggested by Reviewer **egaq**, we have presented further discussions and results on incorporating temporal information to the video anomaly detection experiments, and presented the results in Appendix Section B.4 in the revision.\n- We have clarified both the task novelty and the technical novelty of our paper in response to reviewer **Mzn6**’s comments. \n- We have presented further clarifications on the terms ‘Normal’ and ‘Abnormal’, and discussed the advantages compared to other methods including non-deep-learning methods in response to the comments of Reviewer **d5Wi**.\n- We have corrected typos, improved the equations, and included explanations to the metrics as suggested by the reviewers. \n\nAs the final deadline for the discussion period is approaching, we sincerely hope that reviewers will read our response again to see if there are any further concerns that we can address.\n\nThank you,\n\nAuthors\n"
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "readers": [
          "everyone",
          "ICLR.cc/2022/Conference/Program_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Senior_Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Reviewers",
          "ICLR.cc/2022/Conference/Paper193/Reviewers/Submitted",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ]
      },
      {
        "id": "moSgZxYTZvU",
        "original": null,
        "number": 15,
        "cdate": 1638154734713,
        "mdate": 1638154734713,
        "ddate": null,
        "tcdate": 1638154734713,
        "tmdate": 1638154734713,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Comment",
        "content": {
          "title": "Message to reviewer d5Wi and reviewer Mzn6",
          "comment": "Dear reviewer **d5Wi** and reviewer **Mzn6**,\n\nThank you again for your time reviewing our paper. We have tried hard to respond to your comments. As the final deadline of the discussion period is approaching in one day, we would like to know if our responses have addressed your concerns. And please do not hesitate to let us know if you have any further concerns that we can use this last chance to address.\n\nThank you,\n\nAuthors\n"
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "readers": [
          "everyone",
          "ICLR.cc/2022/Conference/Paper193/Senior_Area_Chairs",
          "ICLR.cc/2022/Conference/Program_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Reviewers",
          "ICLR.cc/2022/Conference/Paper193/Reviewers/Submitted",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ]
      },
      {
        "id": "3-G1rb7j8kF",
        "original": null,
        "number": 1,
        "cdate": 1642696843707,
        "mdate": null,
        "ddate": null,
        "tcdate": 1642696843707,
        "tmdate": 1642696843707,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Decision",
        "content": {
          "title": "Paper Decision",
          "decision": "Reject",
          "comment": "This work tries to tackle the problem of anomaly detection across different tasks. To do so, authors employ energy-based models (EBMs) and define an outlier score in terms of the EBM energies, having a shared sparse code for different tasks. This pipeline is tested on some image and video anomaly datasets for industrial inspection.\n\nThe reviewers highlighted some concerns that need to be addressed before the paper is ready for publication. \n\nFirst, a revision could benefit from a rewriting the clearly formalizes the learning problem from page 2 and then discusses about the possible modeling options given i) the task at hand and ii) some efficiency requirements.\n\nSecond, concerning the modeling choices of the proposed pipeline, the motivation behind the choice of EBMs should be strengthened. For example, it is not clear why the proposed sparse coding could be used for any other latent variable probabilistic model. As observed by one reviewer, the pros of having energies instead of probabilities (or just reconstructions from a deterministic autoencoder) is not discussed sufficiently. Additionally, the heuristics of running Langevin dynamics for only 5 steps should be backed up by stronger empirical evidence as it lacks theory, and it should be discussed how much you should run the Markov chain to obtain sensible negative samples.\n\nThird, conclusions over the experiments on the provided benchmarks seem preliminary. For instance, a new revision could benefit from adding a statistical significance analysis to the reported accuracies. I appreciate that authors added further ablation studies including experiments on contaminated data in the latest revision. I suggest them to extend the experimental suite to more benchmarks including the commonly used for anomaly detection."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Program_Chairs"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference/Program_Chairs"
        ]
      }
    ],
    "directReplies": [
      {
        "id": "_gCmFqMziZD",
        "original": null,
        "number": 1,
        "cdate": 1635826995959,
        "mdate": null,
        "ddate": null,
        "tcdate": 1635826995959,
        "tmdate": 1635826995959,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Review",
        "content": {
          "summary_of_the_paper": "The paper presents an anomaly detection algorithm that uses an EBM (Energy Based Model) to distinguish between 'normal' and 'anomaly'. This model generates pseudo-anomaly instances on-the-fly for each 'normal' instance and then learns to assign low energy to normal instances and high energy to pseudo-anomaly instances. The model is further designed to be able to adapt quickly (few 'normal' labeled examples) to new tasks.",
          "main_review": "Pros:\n1. Presents a well-reasoned set of design choices\n2. Good ablation studies\n\nCons:\n1. Assumes all training data is 'normal'\n2. Lacks experiments with contaminated training data\n\n\nMain Comments\n\n1. Expects all training data to be 'normal' -- effectively makes the algorithm fully supervised since we must manually make sure that all input train data is 'normal'.\n\n2. Should show performance of algorithm when training data is contaminated with anomalies (varying contamination fraction, say, from 0.0 ... 0.10).\n\n3. Section 3.1: \"The sparsity regularization to ... formulated as the mean squared error (MSE) between the original\" -- This is a nice explanation of the design choice.\n",
          "summary_of_the_review": "The paper mixes existing techniques in a nice way to make the overall solution very effective.",
          "correctness": "4: All of the claims and statements are well-supported and correct.",
          "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "flag_for_ethics_review": [
            "NO."
          ],
          "recommendation": "8: accept, good paper",
          "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Reviewer_4fuZ"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Reviewer_4fuZ"
        ]
      },
      {
        "id": "bTGe3YpARgd",
        "original": null,
        "number": 2,
        "cdate": 1636070178453,
        "mdate": null,
        "ddate": null,
        "tcdate": 1636070178453,
        "tmdate": 1636070178453,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Review",
        "content": {
          "summary_of_the_paper": "The author proposes a fast adaptive anomaly detection method using an adaptive sparse coding layer in the few-shot setting. The proposed method outperforms baselines.",
          "main_review": "Strength:\n\n+ The experimental result on two benchmark datasets outperforms most of the baselines.\n+ An ablation study is presented to demonstrate the robustness of the proposed method.\n\nHowever, there are also some places where this paper needs further clarifications:\n- It is not clearly shown in the experiment as to how the technique in Section 3.1 improves the robustness of the network on different types of objects.\n- A small typo in Section 3.1 - visualizations of the hard shrinkage function and SigShrink with different values of $\\tau$ are presented in Fig. 3 rather than Fig. 7.\n- The caption of Table I suggests that “Col 2-5 are fully supervised methods trained with massive normal samples” and are considered as the “upper-bounds”. However, it seems like the first column with AE (SSIM) is able to deliver better results in many categories than these upper bounds? (such as Carpet, Grid, and Bottle).\n- It seems from Table 2 that the proposed method without leveraging any temporal information can achieve even better performance in the CUHK Avenue and the SH-Tech dataset. More discussions are encouraged on the benefit of incorporating such temporal information versus image frames randomly sampled from the target scenes.\n",
          "summary_of_the_review": "To summarize, this paper proposed a fast adaptive anomaly detection framework for anomaly detection in images. The proposed method is technically sound. However, the novelty is limited on the adaptive space coding layer with receptive field, while the rest of the network structure seems to be a big melting pot incorporating the Energy Bassed Model and episodic training in the context of meta-learning based few-shot learning. ",
          "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
          "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "flag_for_ethics_review": [
            "NO."
          ],
          "recommendation": "6: marginally above the acceptance threshold",
          "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Reviewer_egaq"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Reviewer_egaq"
        ]
      },
      {
        "id": "IfVjLa5G-W",
        "original": null,
        "number": 3,
        "cdate": 1636260478756,
        "mdate": null,
        "ddate": null,
        "tcdate": 1636260478756,
        "tmdate": 1636295559743,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Review",
        "content": {
          "summary_of_the_paper": "This paper proposes an image classification system, where a set of normal patterns are stored as a \"dictionary,\" and the degree of deviation is used as the anomaly score. \n \nThe overall architecture seems to feature a conventional deep encoder and a pattern matching module that compares the encoded latent vector against the pattern dictionary. The pattern matching is done by solving the lasso regression problem. \n\nThe authors propose a certain online learning approach, following existing few-shot learning methods, and also a synthetic sample generation approach using random perturbation combined with a gradient method. ",
          "main_review": "This paper can be viewed as a proposal of a new image anomaly detection system that combines existing methods. The proposed \"adaptive\" dictionary-based approach is not new. The use of a deep encoder for image analysis is, of course, not new. The term \"energy-based\" does not mean much because any probability distribution can be thought of as energy-based. So the question is whether the combination is innovative or not. \n\nAlthough I appreciate the authors' efforts to develop an industry-application-ready image processing system, I do not think the technical novelty meets the standard that ICLR papers are supposed to have. \n\n\nEq.(2)\nThe sign of ln Z?\n\nEq.(3) \ny is not defined in the generative model in Eq. (1). \n\np.3\n The problem setting should be clearly defined. What are the input and output? The anomaly score must be clearly defined in the main text as part of the problem setting. ",
          "summary_of_the_review": "- Good industrial use-case paper\n- Limited technical novelty -- less innovative combination of known methods. ",
          "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
          "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
          "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
          "flag_for_ethics_review": [
            "NO."
          ],
          "recommendation": "3: reject, not good enough",
          "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Reviewer_Mzn6"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Reviewer_Mzn6"
        ]
      },
      {
        "id": "vTre9Owal6f",
        "original": null,
        "number": 4,
        "cdate": 1636331808547,
        "mdate": null,
        "ddate": null,
        "tcdate": 1636331808547,
        "tmdate": 1636331808547,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Review",
        "content": {
          "summary_of_the_paper": "The paper proposes a framework for anomaly detection and localization that allows fast adaptation to new tasks. \nSpecifically, the authors propose an energy-based model (EBM) with an adaptive sparse coding layer directly trained with normal features of a target task.\n\nA meta-learning process is followed to extract common knowledge across tasks enabling few shots adaptation. \nShrinkage functions, sparse coding with large receptive fields, and learning by inpainting are introduced to improve and accelerate the EBM\ntraining. ",
          "main_review": "Strengths:\n\n- The method adapts to new tasks autonomously;\n- Ablation study and comparison with supervised models;\n- Exhaustive implementation details in the Appendix section.\n\nWeaknesses: \n\n- Experimental analysis is limited to image and video datasets;\n- The mIoU metric is never defined in the paper;\n- Fairly limited scope of competitor methods (which could depend on the limited suitability of other methods in the adopted setting).",
          "summary_of_the_review": "The paper proposes an interesting anomaly detection approach and an experimental evaluation that also involves fully supervised models.\n\nResults are competitive, and some of them appear close to the upper bound performances provided by supervised alternatives.\n\nThe authors also provide an exhaustive description of the architecture and hyperparameters in the Appendix section.\n\nI think the main merit of the proposed method is the ability to achieve satisfactory anomaly detection performance without large availability of normal samples while adapting to new tasks.",
          "correctness": "4: All of the claims and statements are well-supported and correct.",
          "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
          "flag_for_ethics_review": [
            "NO."
          ],
          "recommendation": "8: accept, good paper",
          "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Reviewer_rnYM"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Reviewer_rnYM"
        ]
      },
      {
        "id": "7JKIsZpFTL-",
        "original": null,
        "number": 5,
        "cdate": 1636354184647,
        "mdate": null,
        "ddate": null,
        "tcdate": 1636354184647,
        "tmdate": 1636354184647,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Review",
        "content": {
          "summary_of_the_paper": "This paper presents a model for detecting irregularities in images, such as would occur in manufacturing acceptance testing.  As a form of anomaly detection, the claims made are for a principled modeling approach and an adaptive algorithm quick to learn from just a few samples.   Based on \"energy based models\" for modeling data densities, the paper claims improvements to avoid the need for retraining for new tasks, such as, instead of synthesizing negative samples rom noise, using a more targeted method of “learning from\ninpainting” operation to learn anomalies. \n\n",
          "main_review": "The paper claims a \"principled\" approach to detecting rare samples compared to normal ones.  One would expect that abnormality implies improbability.  The \"principle\" here is that something abnormal is something whose probability is small.  The paper never avails itself of any discussion of  what it means to be \"anomalous\" in terms of probability.  Similarly neither does the evaluation section mention anything about false positive or false negative detection rates. \n\nAs an example of this confusion, the use of the term \"normal\" in the introduction could refer to a normal, that is Gaussian distribution of the non-anomalous population. Fitting a normal distribution to samples, then looking for samples that fall on the tails of the distribution is a conventional method to detect anomalies.  Since this is not what the paper proposes, the authors may want to clarify this at the outset.  However it raises the speculation whether the mean squared error expressed in Equation 8 is just implicitly an appeal to a normal distribution. A quadratic error term is consistent with the use of a Gaussian (normal) distribution. \n\nHonestly I find it hard to tell if the evaluation presented in the paper makes the case for improvement over other deep learning methods, or more conventional image analysis methods.  It appears the main take-away from the evaluation section is the acceptable detection ability on limited number of samples.   How does this method stack up with previous methods when given comparably large numbers of training samples?  ",
          "summary_of_the_review": "In short, the term 'anomaly detection' has been applied to a wide range of unsupervised techniques, with little in common among them.  This literature, using deep learning methods that have no connection to the existing literature that is more than a decade old, calls into question whether the proposed methods are competitive with previous methods that do not originate by applying deep learning techniques.  One really has to look at the history of the field to claim to have made an advance. \n\nMy apologies for a shallow review due to a lack of familiarity with this branch of the field, however there are some basic questions that need to be raised about the lack of connection of the field with the vast work that precedes the current trend in deep learning to really understand the significance of the work. ",
          "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
          "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
          "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
          "flag_for_ethics_review": [
            "NO."
          ],
          "recommendation": "5: marginally below the acceptance threshold",
          "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Reviewer_d5Wi"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Reviewer_d5Wi"
        ]
      },
      {
        "id": "TPHDSwq9Az-",
        "original": null,
        "number": 11,
        "cdate": 1637890948237,
        "mdate": null,
        "ddate": null,
        "tcdate": 1637890948237,
        "tmdate": 1637890976034,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Comment",
        "content": {
          "title": "Message to reviewers",
          "comment": "Dear reviewers,\n\nOnce again, we would like to express our gratitude to all reviewers for their supportive and constructive feedback. \n\nWe have addressed the following comments and updated our manuscript accordingly:\n- As suggested by Reviewer **4fuZ**, we have performed experiments with contaminated data, and presented the results in Appendix Section B.3 in the revision.\n- As suggested by Reviewer **egaq**, we have presented further discussions and results on incorporating temporal information to the video anomaly detection experiments, and presented the results in Appendix Section B.4 in the revision.\n- We have clarified both the task novelty and the technical novelty of our paper in response to reviewer **Mzn6**’s comments. \n- We have presented further clarifications on the terms ‘Normal’ and ‘Abnormal’, and discussed the advantages compared to other methods including non-deep-learning methods in response to the comments of Reviewer **d5Wi**.\n- We have corrected typos, improved the equations, and included explanations to the metrics as suggested by the reviewers. \n\nAs the final deadline for the discussion period is approaching, we sincerely hope that reviewers will read our response again to see if there are any further concerns that we can address.\n\nThank you,\n\nAuthors\n"
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "readers": [
          "everyone",
          "ICLR.cc/2022/Conference/Program_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Senior_Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Reviewers",
          "ICLR.cc/2022/Conference/Paper193/Reviewers/Submitted",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ]
      },
      {
        "id": "moSgZxYTZvU",
        "original": null,
        "number": 15,
        "cdate": 1638154734713,
        "mdate": 1638154734713,
        "ddate": null,
        "tcdate": 1638154734713,
        "tmdate": 1638154734713,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Official_Comment",
        "content": {
          "title": "Message to reviewer d5Wi and reviewer Mzn6",
          "comment": "Dear reviewer **d5Wi** and reviewer **Mzn6**,\n\nThank you again for your time reviewing our paper. We have tried hard to respond to your comments. As the final deadline of the discussion period is approaching in one day, we would like to know if our responses have addressed your concerns. And please do not hesitate to let us know if you have any further concerns that we can use this last chance to address.\n\nThank you,\n\nAuthors\n"
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "readers": [
          "everyone",
          "ICLR.cc/2022/Conference/Paper193/Senior_Area_Chairs",
          "ICLR.cc/2022/Conference/Program_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Area_Chairs",
          "ICLR.cc/2022/Conference/Paper193/Reviewers",
          "ICLR.cc/2022/Conference/Paper193/Reviewers/Submitted",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference",
          "ICLR.cc/2022/Conference/Paper193/Authors"
        ]
      },
      {
        "id": "3-G1rb7j8kF",
        "original": null,
        "number": 1,
        "cdate": 1642696843707,
        "mdate": null,
        "ddate": null,
        "tcdate": 1642696843707,
        "tmdate": 1642696843707,
        "tddate": null,
        "forum": "sS0dHmaH1I",
        "replyto": "sS0dHmaH1I",
        "invitation": "ICLR.cc/2022/Conference/Paper193/-/Decision",
        "content": {
          "title": "Paper Decision",
          "decision": "Reject",
          "comment": "This work tries to tackle the problem of anomaly detection across different tasks. To do so, authors employ energy-based models (EBMs) and define an outlier score in terms of the EBM energies, having a shared sparse code for different tasks. This pipeline is tested on some image and video anomaly datasets for industrial inspection.\n\nThe reviewers highlighted some concerns that need to be addressed before the paper is ready for publication. \n\nFirst, a revision could benefit from a rewriting the clearly formalizes the learning problem from page 2 and then discusses about the possible modeling options given i) the task at hand and ii) some efficiency requirements.\n\nSecond, concerning the modeling choices of the proposed pipeline, the motivation behind the choice of EBMs should be strengthened. For example, it is not clear why the proposed sparse coding could be used for any other latent variable probabilistic model. As observed by one reviewer, the pros of having energies instead of probabilities (or just reconstructions from a deterministic autoencoder) is not discussed sufficiently. Additionally, the heuristics of running Langevin dynamics for only 5 steps should be backed up by stronger empirical evidence as it lacks theory, and it should be discussed how much you should run the Markov chain to obtain sensible negative samples.\n\nThird, conclusions over the experiments on the provided benchmarks seem preliminary. For instance, a new revision could benefit from adding a statistical significance analysis to the reported accuracies. I appreciate that authors added further ablation studies including experiments on contaminated data in the latest revision. I suggest them to extend the experimental suite to more benchmarks including the commonly used for anomaly detection."
        },
        "signatures": [
          "ICLR.cc/2022/Conference/Program_Chairs"
        ],
        "readers": [
          "everyone"
        ],
        "nonreaders": [],
        "writers": [
          "ICLR.cc/2022/Conference/Program_Chairs"
        ]
      }
    ],
    "invitation": {
      "reply": {
        "writers": {
          "values": [
            "ICLR.cc/2022/Conference"
          ]
        },
        "signatures": {
          "values": [
            "ICLR.cc/2022/Conference"
          ]
        },
        "content": {
          "title": {
            "value-regex": ".*",
            "order": 1
          },
          "authors": {
            "values": [
              "Anonymous"
            ],
            "order": 2
          },
          "authorids": {
            "value-regex": ".*",
            "order": 3
          },
          "keywords": {
            "value-regex": ".*",
            "order": 6
          },
          "abstract": {
            "value-regex": ".*",
            "order": 8
          },
          "pdf": {
            "value-regex": ".*",
            "order": 9
          },
          "one-sentence_summary": {
            "value-regex": ".*",
            "order": 10
          },
          "supplementary_material": {
            "value-regex": ".*",
            "order": 11
          },
          "code_of_ethics": {
            "value-regex": ".*",
            "order": 12
          },
          "submission_guidelines": {
            "value-regex": ".*",
            "order": 13
          },
          "resubmission": {
            "value-regex": ".*",
            "order": 14
          },
          "student_author": {
            "value-regex": ".*",
            "order": 15
          },
          "serve_as_reviewer": {
            "value-regex": ".*",
            "order": 16
          },
          "community_implementations": {
            "required": false,
            "description": "Optional link to open source implementations",
            "value-regex": ".*",
            "markdown": true,
            "order": 103
          }
        }
      },
      "replyForumViews": [],
      "expdate": 1682960118639,
      "signatures": [
        "ICLR.cc/2022/Conference"
      ],
      "readers": [
        "everyone"
      ],
      "writers": [
        "ICLR.cc/2022/Conference"
      ],
      "invitees": [
        "ICLR.cc/2022/Conference"
      ],
      "tcdate": 1632875419419,
      "tmdate": 1682960118686,
      "id": "ICLR.cc/2022/Conference/-/Blind_Submission",
      "type": "note"
    }
  },
  "tauthor": "OpenReview.net"
}